---
kind: type
id: T:Autodesk.Revit.DB.Definitions
source: html/5ff217ff-215d-9d1a-6555-3f45b34a5517.htm
---
# Autodesk.Revit.DB.Definitions

A base class that supports the addition of new parameter definitions.

## Syntax (C#)
```csharp
public class Definitions : IEnumerable<Definition>,
	IDisposable
```

## Remarks
There are two derivations of this class, one of which handles external parameters
and another which handles internal parameters.